/**
 * =====================================================================
 * 【設定エリア】ここを変更することでプログラムの動きを調整できます
 * ■ 変更のルール
 * ・変更するのは、コロン(:)の「右側」にある、""(ダブルクォーテーション)で囲まれた文字や数字だけです。
 * ・コロンの「左側」や「{」「}」などの記号はプログラムの構造ですので、変更しないように注意してください。
 * 例：AFFILIATION: "所属" ←"所属"の部分だけを書き換えます
 * =====================================================================
 */

const CONFIG = {
  // Googleフォームの質問タイトル (フォームの表記と完全に一致させる)
  QUESTIONS: {
    NAME: "名前",
    SITUATION: "出勤・退勤"
  },

  // スプレッドシートの見出し名 (タイトルと完全に一致させる)
  // これにより、列の順番が変わっても自動で変更可
  HEADER: {
    // 実績票
    RECORD: {
      DATE: "日付",
      DOW: "曜日",
      SERVICE_TYPE: "サービス提供の状況",
      START_TIME: "開始時間",
      END_TIME: "終了時間",
      REMARKS: "備考"
    }
  },

  // スプレッドシートのレイアウト(列番号)の設定
  TABLE: {
    // 実績票
    RECORD: {
      // 見出し(タイトル)の行数
      ROWS_PER_TITLE: 3
    }
  },

  // 業務ルールの設定
  LABELS: {
    // 実績票用
    RECORD: {
      // 最終行を取得するために基準となるセルに入っている文字
      TOTAL: "合計",
      // 表の場所を特定するためのタイトルの文字
      ACHIEVEMENTS: "サービス提供実績"
    },
    // 状況 (出勤か退勤か)
    SITUATION: {
      ATTEND_WORK: "出勤",
      LEAVE_WORK: "退勤"
    }
  },

  // スクリプトプロパティのプロパティ名
  // 【注意】
  // ・通常は「スクリプトプロパティ画面」の値(右側)を変更してください。
  // ・画面側の「プロパティ名」(左側)そのものを変えた時のみ、ここ(右側)を書き換えます。
  PROPS: {
    // サンプルの実績記録票のスプレッドシートのID
    RECORD_SS_ID: "***",
    // エラー時のSlackのWebhookのURL
    ERR_SLACK_WEBHOOK_URL: "***",
  }
};

/**
 * =====================================================================
 * 設定エリアはここまでです。これより下のコードはエンジニア専用です。
 * =====================================================================
 */